Tekla.Structures.ModelInternal.dotAssembly_t.aAssemblyOtherPartsIds
All the Secondary assemblables IDs of the Assembly.

Tekla.Structures.ModelInternal.dotAssembly_t.aAssemblySubAssemblyIds
All the subassembly IDs of the Assembly.